spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/returns_an_error_message_for_declined_charges.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=4&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.4
      Authorization:
      - Bearer sk_test_c5I9VU9KjDJoyICPO4ZDnb9E
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.4","lang":"ruby","lang_version":"2.1.4 p265 (2014-10-27)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tho-VirtualBox 3.13.0-24-generic #47-Ubuntu SMP Fri May 2 23:30:00 UTC 2014
        x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 22 Apr 2015 04:25:18 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '728'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_tpd0ip9ydwHWwGEq
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_15uFQICefoGgth4Q0gl8JnXz",
          "livemode": false,
          "created": 1429676718,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_15uFQICefoGgth4QLmqRKHCw",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 4,
            "exp_year": 2018,
            "fingerprint": "zE6Sz7VR5mHMOmdJ",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null
          },
          "client_ip": "98.198.185.160"
        }
    http_version: 
  recorded_at: Wed, 22 Apr 2015 04:25:18 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&source=tok_15uFQICefoGgth4Q0gl8JnXz&description=an%20invalid%20charge
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.4
      Authorization:
      - Bearer sk_test_c5I9VU9KjDJoyICPO4ZDnb9E
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.4","lang":"ruby","lang_version":"2.1.4 p265 (2014-10-27)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tho-VirtualBox 3.13.0-24-generic #47-Ubuntu SMP Fri May 2 23:30:00 UTC 2014
        x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '93'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Wed, 22 Apr 2015 04:25:19 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8WpLOMAuHo6SUF96
      Stripe-Version:
      - '2015-04-07'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_15uFQICefoGgth4QE0RVppSQ"
          }
        }
    http_version: 
  recorded_at: Wed, 22 Apr 2015 04:25:19 GMT
recorded_with: VCR 2.9.3
